app/Models/RattrapageModel.php

SELECT "rattrapage".*, "etu"."numero_etudiant", "pe_etud"."nom" AS "nom_etud", "pe_etud"."prenom" AS "prenom_etud", "mat"."nom" AS "matiere", "sem"."code" AS "semestre", "pe_ens"."nom" AS "nom_ens", "pe_ens"."prenom" AS "prenom_ens", "etat"."code" AS "code_etat", "etat"."libelle" AS "libelle_etat"
FROM "rattrapage"
JOIN "etudiant" "etu" ON "etu"."id_etudiant" = "rattrapage"."id_etudiant"
JOIN "personne" "pe_etud" ON "pe_etud"."id_personne" = "etu"."id_personne"
JOIN "enseignant" "ens" ON "ens"."id_enseignant" = "rattrapage"."id_enseignant"
JOIN "personne" "pe_ens" ON "pe_ens"."id_personne" = "ens"."id_personne"
JOIN "semestre" "sem" ON "sem"."id_semestre" = "rattrapage"."id_semestre"
JOIN "etat_rattrapage" "etat" ON "etat"."id_etat" = "rattrapage"."id_etat"
LEFT JOIN "matiere" "mat" ON "mat"."id_matiere" = "rattrapage"."id_matiere"
ORDER BY "date_rattrapage" ASC
---
    public function getAllWithDetails()
    {
        return $this->select('
                rattrapage.*,
                etudiant.nom AS nom_etudiant,
                etudiant.prenom AS prenom_etudiant,
                enseignant.nom AS nom_enseignant,
                enseignant.prenom AS prenom_enseignant,
                matiere.nom_matiere,
                semestre.nom_semestre
            ')
            ->join('etudiant', 'rattrapage.code = etudiant.code')
            ->join('ds', 'rattrapage.id_ds = ds.id_ds')
            ->join('matiere', 'ds.id_matiere = matiere.id_matiere')
            ->join('semestre', 'matiere.id_semestre = semestre.id_semestre')
            ->join('enseignant', 'ds.code_enseignant = enseignant.code')
            ->orderBy('rattrapage.date_rattrapage', 'DESC')
            ->orderBy('etudiant.nom', 'ASC')
            ->findAll();