app/Models/UserModel.php

SELECT "users".*, "personne"."nom", "personne"."prenom", "personne"."email"
FROM "users"
JOIN "personne" ON "personne"."id_personne" = "users"."id_personne"
WHERE "users"."username" = 'cj220604'
 LIMIT 1
---
    public function findByUsernameWithPersonne(string $username)
    {
        return $this->select('users.*, personne.nom, personne.prenom, personne.email')
                    ->join('personne', 'personne.id_personne = users.id_personne')
                    ->where('users.username', $username)
                    ->first();

SELECT "users".*, "personne"."nom", "personne"."prenom", "personne"."email"
FROM "users"
JOIN "personne" ON "personne"."id_personne" = "users"."id_personne"
WHERE "users"."reset_token" = '699680ad7ec21946ec66e87144084fbe'
AND "users"."reset_expires" >= '2025-11-25 19:55:51'
 LIMIT 1
---
    public function findByResetToken(string $token)
    {
        return $this->select('users.*, personne.nom, personne.prenom, personne.email')
                    ->join('personne', 'personne.id_personne = users.id_personne')
                    ->where('users.reset_token', $token)
                    ->where('users.reset_expires >=', date('Y-m-d H:i:s'))
                    ->first();